[A_Rush_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="突然袭击"
mTooltip="处于血怒中的友方生物获得 %buff.buff.stat %buff.buff.stat.icon 移动力。"

[A_WarlordsFury_Buff H7BaseBuff]
mName="战神之怒"
mTooltip="英雄的基础伤害提高 %stat1。"

[A_BurstingRage_Buff H7BaseBuff]
mName="勃然大怒"
mTooltip=""

[A_BurstingRage_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="勃然大怒"
mTooltip="血怒结束时，所有友方生物对周围的敌方单位造成伤害。伤害为血怒持续完整战斗回合数的70倍。"

[A_Bloodrage_Buff H7BaseBuff]
mName="血怒"
mTooltip="%stat5 %ICON_ATTACK 攻击\n\n%stat5.norm 血怒\n-2 在战斗回合结束时，或者如果生物执行等待或防御动作。"

[A_FieryRage_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="怒火中烧"
mTooltip="处于血怒中的友方生物获得 %buff1.buff.stat1 %ICON_INITIATIVE 主动性。"

[A_Rush_Buff H7BaseBuff]
mName="突然袭击"
mTooltip="血怒激活期间获得 %stat %stat.icon 移动力。"

[A_WarlordsFury_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战神之怒"
mTooltip="当前血怒值的7倍加到英雄的基础伤害上。"

[A_MightOverMagic_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="退魔之力"
mTooltip="处于血怒中的友方生物只受到法术直接伤害的一半。"

[A_Bloodrage_Buff_DefendWaitMalus H7BaseBuff]
mName=""
mTooltip=""

[A_FatherSkysFury_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天父之怒"
mTooltip="英雄起始血怒值增加1点。\n每当任何生物队伍被消灭时，血怒值增加3点。"

[A_Bloodlust_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="嗜血奇术"
mTooltip="当前血怒值的两倍加到所有友方生物的士气上。"

[A_Bloodrage_Buff_Marker H7BaseBuff]
mName="血怒标记 - 生物执行了攻击"
[A_Bloodrage_Buff_NoAttackMalus H7BaseBuff]
mName="血怒"

UCP 1.1

[A_Bloodrage_Skill H7Skill]
mDescriptions[0]="军队以完全愤怒的状态开始战斗。这使得他们能快速而猛烈地攻击，但怒气会随时间消退。"
mDescriptions[1]=""
mDescriptions[2]="英雄起始拥有5点血怒。血怒会加到友方生物的 %ICON_ATTACK 攻击上，但会在战斗中减少：\n%buff2.buff.stat 每当一个生物使用等待或防御动作时。\n%stat4 在每个战斗回合结束时。\n一旦血怒值降至0，血怒结束。\n（不影响：亡灵和构造体）"
mDescriptions[3]="英雄起始血怒值额外增加1点。"
mDescriptions[4]="英雄起始血怒值额外增加1点。"
mName="血怒"
mTooltip="据点族技能。"